Repository: xinxin6623/fanyibiji
Catalog: PersonalAgent/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# capture.hint
source: Press the button or your configured hotkey to select a screen region.
zh_hans: 点按按钮或按你设置的快捷键框选屏幕区域。

# capture.run
source: Capture & Recognize
zh_hans: 截屏取词

# clipboard.query
source: Query Clipboard
zh_hans: 取词问 AI

# clipboard.translate
source: Translate Clipboard
zh_hans: 取词翻译

# error.cancelled
source: Request cancelled.
zh_hans: 请求已取消。

# error.invalid_input
source: Invalid input or missing configuration.
zh_hans: 输入无效或配置缺失。

# error.network
source: Network error. Please retry.
zh_hans: 网络错误，请重试。

# error.permission
source: Permission denied.
zh_hans: 权限被拒绝。

# error.persistence
source: Failed to save result locally.
zh_hans: 本地保存结果失败。

# error.provider_rejected
source: The provider rejected the request.
zh_hans: 服务方拒绝了请求。

# error.timeout
source: Request timed out. Please retry.
zh_hans: 请求超时，请重试。

# error.unknown
source: Unknown error.
zh_hans: 未知错误。

# history.empty
source: No history yet.
zh_hans: 暂无历史记录。

# history.failed_tag
source: failed
zh_hans: 失败

# history.hide
source: Hide History
zh_hans: 隐藏历史

# history.show
source: History
zh_hans: 历史

# permission.guide
source: Screen Recording / Accessibility permission is required. Grant it in System Settings, then retry.
zh_hans: 需要屏幕录制 / 辅助功能权限。请在系统设置中开启后重试。

# permission.open_settings
source: Open System Settings
zh_hans: 打开系统设置

# query.cancel
source: Cancel
zh_hans: 取消

# query.idle
source: Result will appear here.
zh_hans: 结果将显示在这里。

# query.loading
source: Querying…
zh_hans: 查询中…

# query.prompt
source: Paste or type text, then run a query
zh_hans: 粘贴或输入文本，然后发起查询

# query.retry
source: Retry
zh_hans: 重试

# query.run
source: Run Query
zh_hans: 发起查询

# tts.cancel
source: Cancel
zh_hans: 取消

# tts.engine
source: Engine
zh_hans: 引擎

# tts.engine.standard
source: Standard
zh_hans: 普通

# tts.engine.super
source: Super-Realistic
zh_hans: 超拟人

# tts.oral
source: Oral Style
zh_hans: 口语化

# tts.oral.high
source: High
zh_hans: 高

# tts.oral.low
source: Low
zh_hans: 低

# tts.oral.mid
source: Medium
zh_hans: 中

# tts.pause
source: Pause
zh_hans: 暂停

# tts.pitch
source: Pitch
zh_hans: 音调

# tts.play
source: Play
zh_hans: 播放

# tts.prompt
source: Text to synthesize
zh_hans: 待合成文本

# tts.run
source: Synthesize & Play
zh_hans: 合成并播放

# tts.section
source: Text to Speech
zh_hans: 语音合成

# tts.speed
source: Speed
zh_hans: 语速

# tts.synthesizing
source: Synthesizing…
zh_hans: 合成中…

# tts.voice
source: Voice
zh_hans: 发音人

# tts.volume
source: Volume
zh_hans: 音量

# settings.hotkey.title
source: Hotkey Settings
zh_hans: 快捷键设置

# settings.hotkey.translate_selection
source: Translate Selection
zh_hans: 划词翻译

# settings.hotkey.translate_selection.hint
source: Select text anywhere, press this hotkey to translate it directly.
zh_hans: 在任意位置选中文字，按此快捷键直接翻译。

# settings.hotkey.capture_ocr
source: Screenshot OCR
zh_hans: 截屏取词

# settings.hotkey.capture_ocr.hint
source: Drag to select a screen region, OCR then translate.
zh_hans: 框选屏幕区域，OCR 识别后翻译。

# settings.hotkey.record
source: Record
zh_hans: 录制

# settings.hotkey.recording
source: Recording…
zh_hans: 录制中…

# settings.hotkey.press_keys
source: Press keys…
zh_hans: 请按下组合键…

# settings.hotkey.save
source: Save
zh_hans: 保存

# settings.hotkey.cancel
source: Cancel
zh_hans: 取消

# settings.hotkey.reset
source: Reset to Defaults
zh_hans: 恢复默认

# settings.hotkey.conflict
source: Both hotkeys are identical. Screenshot OCR takes priority; selection translation will not trigger.
zh_hans: 两个快捷键相同。截屏取词优先，划词翻译将无法触发。

# settings.secret.title
source: API Keys
zh_hans: API 密钥

# settings.secret.hint
source: Stored in macOS Keychain. Saving here binds access to this app — no more repeated password prompts.
zh_hans: 保存到 macOS 钥匙串。在此保存会把访问权绑定到本应用，不再反复弹密码。

# settings.secret.tts_app_id
source: Xunfei TTS AppID
zh_hans: 讯飞 TTS AppID

# settings.secret.tts_api_key
source: Xunfei TTS APIKey
zh_hans: 讯飞 TTS APIKey

# settings.secret.tts_api_secret
source: Xunfei TTS APISecret
zh_hans: 讯飞 TTS APISecret

# settings.secret.configured
source: Configured
zh_hans: 已配置

# settings.secret.not_configured
source: Not set
zh_hans: 未配置

# settings.secret.placeholder_set
source: Configured — leave blank to keep
zh_hans: 已配置，留空则不改

# settings.secret.placeholder_empty
source: Enter key
zh_hans: 输入密钥

# settings.secret.save
source: Save Keys
zh_hans: 保存密钥

# settings.secret.saved
source: Keys saved to Keychain
zh_hans: 密钥已保存到钥匙串

# settings.secret.save_note
source: Filled keys are saved together with the bottom Save button.
zh_hans: 填写的密钥会随底部「保存」按钮一起保存。

# settings.prompt.title
source: System Prompt
zh_hans: 系统提示词

# settings.prompt.hint
source: Constrains LLM query behavior (does not affect translation). Leave blank to restore default.
zh_hans: 约束 LLM 查询行为（不影响翻译）。留空保存则恢复默认。

# settings.prompt.reset
source: Restore Default
zh_hans: 恢复默认提示词

# result.title
source: Result
zh_hans: 翻译结果

# query.clear
source: Clear
zh_hans: 清空

# lang.auto_detect
source: Auto Detect
zh_hans: 自动检测

# lang.english
source: English
zh_hans: 英语

# lang.japanese
source: 日本語
zh_hans: 日语

# lang.korean
source: 한국어
zh_hans: 韩语

# lang.french
source: Français
zh_hans: 法语

# lang.german
source: Deutsch
zh_hans: 德语

# lang.spanish
source: Español
zh_hans: 西班牙语

# settings.tab.general
source: General
zh_hans: 通用

# settings.tab.hotkey
source: Hotkeys
zh_hans: 快捷键

# settings.tab.secret
source: API Keys
zh_hans: 密钥

# settings.tab.prompt
source: Prompt
zh_hans: 提示词

# settings.general.lang_section
source: Translation Language
zh_hans: 翻译语言

# settings.general.target_lang
source: Target Language
zh_hans: 目标语言

# settings.general.source_lang
source: Source Language
zh_hans: 源语言
